#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.repository_api_gateway will be updated in-place
  ~ resource "github_repository" "repository_api_gateway" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for aggregating requests to storage services"
        etag               = "W/\"20e018833485b5c9e9137efee0dcc562\""
        full_name          = "NextGenConf/ApiGateway"
        git_clone_url      = "git://github.com/NextGenConf/ApiGateway.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ApiGateway"
        http_clone_url     = "https://github.com/NextGenConf/ApiGateway.git"
        id                 = "ApiGateway"
        license_template   = "mit"
        name               = "ApiGateway"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ApiGateway.git"
        svn_url            = "https://github.com/NextGenConf/ApiGateway"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_service will be updated in-place
  ~ resource "github_repository" "repository_conference_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "Microservice for storing conferences"
        etag               = "W/\"a15c6c07aad757f26745e14e0a17578c\""
        full_name          = "NextGenConf/ConferenceService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceService.git"
        id                 = "ConferenceService"
        name               = "ConferenceService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceService"
      - topics             = [] -> null
    }

  # github_repository.repository_conference_session_service will be updated in-place
  ~ resource "github_repository" "repository_conference_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing the relationship between conferences and sessions"
        etag               = "W/\"b4390f761133b63c9a791d8a8342fae9\""
        full_name          = "NextGenConf/ConferenceSessionService"
        git_clone_url      = "git://github.com/NextGenConf/ConferenceSessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/ConferenceSessionService"
        http_clone_url     = "https://github.com/NextGenConf/ConferenceSessionService.git"
        id                 = "ConferenceSessionService"
        license_template   = "mit"
        name               = "ConferenceSessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/ConferenceSessionService.git"
        svn_url            = "https://github.com/NextGenConf/ConferenceSessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_feed_service will be updated in-place
  ~ resource "github_repository" "repository_feed_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference feeds"
        etag               = "W/\"5ea72b21d1ccf1760c3dc6676639f2ac\""
        full_name          = "NextGenConf/FeedService"
        git_clone_url      = "git://github.com/NextGenConf/FeedService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/FeedService"
        http_clone_url     = "https://github.com/NextGenConf/FeedService.git"
        id                 = "FeedService"
        license_template   = "mit"
        name               = "FeedService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/FeedService.git"
        svn_url            = "https://github.com/NextGenConf/FeedService"
      - topics             = [] -> null
    }

  # github_repository.repository_k8s_config will be created
  + resource "github_repository" "repository_k8s_config" {
      + allow_merge_commit = false
      + allow_rebase_merge = false
      + allow_squash_merge = true
      + archived           = false
      + default_branch     = (known after apply)
      + description        = "Repository containing the kubernetes resource files for the NextGenConf cluster"
      + etag               = (known after apply)
      + full_name          = (known after apply)
      + git_clone_url      = (known after apply)
      + has_issues         = true
      + has_projects       = false
      + html_url           = (known after apply)
      + http_clone_url     = (known after apply)
      + id                 = (known after apply)
      + license_template   = "mit"
      + name               = "KubeConfig"
      + ssh_clone_url      = (known after apply)
      + svn_url            = (known after apply)
    }

  # github_repository.repository_session_service will be updated in-place
  ~ resource "github_repository" "repository_session_service" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "Microservice for storing conference sessions"
        etag               = "W/\"45f323bfa4f01ff6ac09dd577d026d2c\""
        full_name          = "NextGenConf/SessionService"
        git_clone_url      = "git://github.com/NextGenConf/SessionService.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/SessionService"
        http_clone_url     = "https://github.com/NextGenConf/SessionService.git"
        id                 = "SessionService"
        license_template   = "mit"
        name               = "SessionService"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/SessionService.git"
        svn_url            = "https://github.com/NextGenConf/SessionService"
      - topics             = [] -> null
    }

  # github_repository.repository_web_app will be updated in-place
  ~ resource "github_repository" "repository_web_app" {
        allow_merge_commit = false
        allow_rebase_merge = false
      ~ allow_squash_merge = false -> true
        archived           = false
        auto_init          = false
        default_branch     = "master"
        description        = "React app displaying conferences"
        etag               = "W/\"e99f01141f3d9ce6c6e4b65ae5203ab8\""
        full_name          = "NextGenConf/WebApp"
        git_clone_url      = "git://github.com/NextGenConf/WebApp.git"
        has_downloads      = false
        has_issues         = true
        has_projects       = false
        has_wiki           = false
        html_url           = "https://github.com/NextGenConf/WebApp"
        http_clone_url     = "https://github.com/NextGenConf/WebApp.git"
        id                 = "WebApp"
        name               = "WebApp"
        private            = false
        ssh_clone_url      = "git@github.com:NextGenConf/WebApp.git"
        svn_url            = "https://github.com/NextGenConf/WebApp"
      - topics             = [] -> null
    }

Plan: 1 to add, 6 to change, 0 to destroy.
```

</details>

*Workflow: `ci pr`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
